const config = {
    serverURL: 'http://54.175.24.134:3030',
    BOARD_SIZE: 30, //Довжина сторони грального поля

    snake: {
        START_LENGTH: 5, //Стартова довжина змійки (В клітках)
        SCORE_FOR_LENGTH_GROWTH: 15, //Кількість очок, які треба набрати, щоб вирости на 1 клітку.
        START_SPEED: 3, //Початкова швидкість (в клітках за секунду)
        MAX_SPEED: 15, //Максимально можлива швидкість руху змійки
        SCORE_FOR_SPEED_INCREASE: 50, //Кількість очок, які треба набрати, щоб пришвидшитися.
        SPEED_INCREASE: 1.2, //Відносна величина прискорення.
    },
    food:{
        basicFood:[ //На ігровому полі завжди є одна клітка з базовою їжею. Коли гравець її з'їдає, генерується нова.
            {
                name: 'currant',
                color: 'darkslateblue', // Колір їжі на ігровому полі
                score: 1, // Кількість очок, що даються за з'їдання
                probability: 0.6 // Значення дискретної функції розподілу ймовірностей випадання для даного типу їжі
            },
            {
                name: 'blueberry',
                color: 'deepskyblue',
                score: 2,
                probability: 1
            }
        ],
        GOOD_FOOD_SPAWN_PROBABILITY: 0.5, // Ймовірність того, що після того, як гравець щось з'їсть, на полі окрім
        // клітинки з базовою їжею з'явиться додаткова клітинка з "хорошою" їжею, яка дає значно більше очок,
        // однак, має обмежений час існування.

        goodFood:[
            {
                name: 'apple',
                color: 'red',
                score: 5,
                lifetime: 1, // Відношення часу існування даної їжі, до часу, необхідного для подолання змійкою всього ігрового поля.
                probability: 0.7
            },
            {
                name: 'pear',
                color: 'goldenrod',
                score: 10,
                lifetime: 0.7,
                probability: 1
            }
        ]
    }
}


export default config;